module.exports = {
  fajr: {
    title: "الفجر",
    hour: 4,
    minute: 24,
    verse: "إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا"
  },

  dhuhr: {
    title: "الظهر",
    hour: 13,
    minute: 33,
    verse: "فَأَقِيمُوا الصَّلَاةَ ۚ إِنَّ الصَّلَاةَ كَانَتْ عَلَى الْمُؤْمِنِينَ كِتَابًا مَوْقُوتًا"
  },

  asr: {
    title: "العصر",
    hour: 17,
    minute: 14,
    verse: "وَالَّذِينَ هُمْ عَلَىٰ صَلَوَاتِهِمْ يُحَافِظُونَ"
  },

  maghrib: {
    title: "المغرب",
    hour: 20,
    minute: 45,
    verse: "وَسَبِّحْ بِالْعَشِيِّ وَالْإِبْكَارِ"
  },

  isha: {
    title: "العشاء",
    hour: 22,
    minute: 18,
    verse: "وَالَّذِينَ هُمْ عَلَىٰ صَلَوَاتِهِمْ يُحَافِظُونَ"
  }
};
