module.exports = {
  fajr: {
    name: "الفجر",
    verse: "﴿ وَقُرْآنَ الْفَجْرِ إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا ﴾",
    details:
      "صلاة الفجر هي مقياس براءة الإنسان من النفاق، والمحافظة عليها في وقتها أمارة على نيل ذمة الله وحفظه؛ لقوله ﷺ: «مَن صَلَّى صَلَاةَ الصُّبْحِ فَهُوَ فِي ذِمَّةِ اللَّهِ».\n📚 رواه مسلم\n***صــلاة الــفــجــر***\n• **عدد ركعاتها:** 2\n• **سنتها القبلية:** 2\n• **سنتها البعدية:** 0"
  },
  dhuhr: {
    name: "الظهر",
    verse: "﴿ إِنَّ الصَّلَاةَ كَانَتْ عَلَى الْمُؤْمِنِينَ كِتَابًا مَوْقُوتًا ﴾",
    details:
      "صلاة الظهر هي أول صلاة فُرضت وصُلِّيت في الإسلام، والمحافظة عليها وسط النهار أمارة على فتح أبواب السماء واستجابة الدعاء؛ لقوله ﷺ: «إنَّها ساعةٌ تُفْتَحُ فيها أبوابُ السَّماءِ، فأحبُّ أن يصعَدَ لي فيها عملٌ صالحٌ».\n📚 رواه الترمذي وصححه الألباني\n***صــلاة الــظــهــر***\n• **عدد ركعاتها:** 4\n• **سنتها القبلية:** 4\n• **سنتها البعدية:** 2"
  },
  asr: {
    name: "العصر",
    verse: "﴿ حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلَاةِ الْوُسْطَى وَقُومُوا لِلَّهِ قَانِتِينَ ﴾",
    details:
      "صلاة العصر هي الصلاة الوسطى التي خصّها الله بمزيد من التأكيد، والمحافظة عليها أمارة على الفوز بضعف الأجر والسلامة من حبوط العمل؛ لقوله ﷺ: «الَّذي تفوتُهُ صلاةُ العصرِ فأنَّما وُتِرَ أَهْلَهُ ومالَهُ».\n📚 رواه البخاري ومسلم\n***صــلاة الــعــصــر***\n• **عدد ركعاتها:** 4\n• **سنتها القبلية:** 0\n• **سنتها البعدية:** 0"
  },
  maghrib: {
    name: "المغرب",
    verse: "﴿ وَأْمُرْ أَهْلَكَ بِالصَّلَاةِ وَاصْطَبِرْ عَلَيْهَا ﴾",
    details:
      "صلاة المغرب هي وتر النهار، والمحافظة عليها فور غروب الشمس أمارة على استقامة الأمة؛ لقوله ﷺ: «لا تزالُ أمَّتي بخَيرٍ - أو قالَ: علَى الفِطرةِ - ما لَم يؤخِّروا المَغربَ حتَّى تشتبِكَ النُّجومُ».\n📚 رواه أبو داود وأحمد\n***صــلاة الــمـغــرب***\n• **عدد ركعاتها:** 3\n• **سنتها القبلية:** 0\n• **سنتها البعدية:** 2"
  },
  isha: {
    name: "العشاء",
    verse: "﴿ وَأَقِمِ الصَّلَاةَ طَرَفَيِ النَّهَارِ وَزُلَفًا مِّنَ اللَّيْلِ ﴾",
    details:
      "صلاة العشاء هي أثقل صلاة على المنافقين، والمحافظة عليها في جماعة أمارة على قيام نصف الليل ونيل النور التام يوم القيامة؛ لقوله ﷺ: «مَن صلَّى العِشاءَ في جماعةٍ فكأنَّما قامَ نِصفَ اللَّيلِ».\n📚 رواه مسلم\n***صــلاة الــعــشــاء***\n• **عدد ركعاتها:** 4\n• **سنتها القبلية:** 0\n• **سنتها البعدية:** 2"
  }
};
